app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2009-05-15 07:15:09', 'e4517ecbcce833242081e2dc9abdc3c54f3fc8ff23ac344f1c7c1956161ea43efc5b9336913547ffca95a656119aa4f0394ae9da12eb2c07c7726cfed2bf6b75', '2009-05-15 07:15:09', 'deepak', '3Jib5eTd09RzC_GNiLnV', '0e6eaddb3240b3703d954379ba4eb1c8e4ad3fb9d743f907c4bc2f3b934ece8a209405f1ab27e7e26fe60fd1ce1cb096408947b0cb4d5e605a7e621503cd8972', 'deepak.prasanna@artha42.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2009-05-15 08:00:44', `username` = 'deepak.prasanna' WHERE `id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])